[
    {
        "name": "MSI 16 QHD+ (Intel Ultra 7, 32GB RAM, 1TB SSD, Touchscreen)",
        "description": "<p>Experience the future of computing with the MSI 16-inch QHD+ laptop, designed for power users and professionals alike. Powered by the cutting-edge Intel® Core™ Ultra 7 processor 155H and Intel® Arc Graphics, this laptop is engineered to handle demanding tasks with ease, from content creation to high-end gaming. The stunning 16:10 QHD+ display with 100% DCI-P3 color accuracy and 400 nits brightness brings your visuals to life, whether you're editing videos or streaming content. With a massive 1TB NVMe PCIe Gen4x4 SSD and 32GB of LPDDR5 RAM, you'll experience lightning-fast performance and ample storage for all your needs.</p><ul><li>Next-Gen Processing Power - The Intel® Core™ Ultra 7 processor, coupled with Intel® Arc Graphics, delivers exceptional performance for multitasking, creative work, and gaming on Windows 11 Home.</li><li>Immersive Visuals - Dive into ultra-vivid visuals on the 16-inch QHD+ (2560x1600) IPS-Level panel, featuring a 16:10 aspect ratio, 100% DCI-P3 color gamut, and 400 nits of brightness for true-to-life colors and sharp details.</li><li>Uncompromised Storage and Memory - Enjoy the speed and reliability of a 1TB NVMe PCIe Gen4x4 SSD, paired with 32GB of LPDDR5 RAM, ensuring smooth and efficient performance for all your applications.</li><li>Stay Connected Anywhere - With Intel® Killer™ Wi-Fi 7 BE1750(w), experience faster and more reliable wireless connectivity, perfect for streaming, gaming, and remote work.</li><li>Designed for Durability - The laptop features a robust 4-cell, 99Whr battery that keeps you powered throughout the day, complemented by a sleek and durable design that includes a single backlit keyboard and MSI Topload Bag for added protection.</li><li>Comprehensive Warranty - Enjoy peace of mind with a 1-year warranty, ensuring your investment is protected. *Copilot key feature availability varies by market, see [aka.ms/Keysupport](https://aka.ms/Keysupport) for details.</li></ul>",
        "price": 134990.00,
        "discount_price": 117990.00,
        "sku": "MSI-16QHD-I7-32GB-1TB-TS",
        "brand": "MSI",
        "images":[
            "/media/Ultrabooks/MSI_16/80452eb2-76ad-43b6-8d8b-bc4e9bf9431c.jpg",
            "/media/Ultrabooks/MSI_16/20b07fe6-94a0-496a-8957-95145d2c567d.jpg",
            "/media/Ultrabooks/MSI_16/a27c6392-721d-4491-8444-2abd1856ee34.jpg",
            "/media/Ultrabooks/MSI_16/f4440a62-1fe5-40b4-957d-b5873f93490e.jpg",
            "/media/Ultrabooks/MSI_16/4c0468f0-4f7a-4aeb-b497-d71728aa5ad8.jpg"
        ],
        "stock": 1,
        "is_available": "True",
        "rating": 4.1,
        "num_reviews": 5,
        "dimensions": "49.9 x 33.9 x 13.6 cm",
        "weight": 1.5,
        "warranty": "1 year",
        "color": "Stellar Gray",
        "laptop_type": "Ultrabooks",
        "cpu": "Intel® Core™ Ultra 7 processor 155H",
        "ram": "32 GB",
        "storage": "1 TB SSD",
        "display": "16 inches",
        "graphics": "Intel® Arc Graphics",
        "operating_system": "Windows 11 Home",
        "battery_life": "8 to 12 hours",
        "touchscreen": "False"
    },
    {
        "name": "Samsung Galaxy Book3 Ultra (13th Gen Intel i7, 32GB RAM, 1TB SSD, RTX 4070, AMOLED Touchscreen)",
        "description": "<p>Unleash top-tier performance and vibrant visuals with the Samsung Galaxy Book3 Ultra. Powered by the latest 13th Gen Intel® Core™ i7-1360P processor, this laptop is designed for both gaming and professional tasks. The 16\" WQXGA AMOLED touchscreen display offers an immersive viewing experience with its 3840 x 2160 pixel resolution and stunning color accuracy. Equipped with the NVIDIA® GeForce RTX™ 4070 graphics, it ensures smooth and high-quality visuals. With 32GB of DDR5 RAM and a 512GB NVMe SSD, you have ample memory and storage for seamless multitasking and quick data access. The sleek Graphite chassis houses advanced technology, including a high-capacity battery and a range of connectivity options.</p><ul><li>Exceptional Performance - Driven by the 13th Gen Intel® Core™ i7-1360P processor and 32GB of DDR5 RAM, this laptop provides fast processing and efficient multitasking capabilities.</li><li>Vivid Display - The 16\" WQXGA AMOLED touchscreen delivers breathtaking detail and vibrant colors with a 3840 x 2160 pixel resolution and 400 nits of brightness for an enhanced viewing experience.</li><li>High-Performance Graphics - NVIDIA® GeForce RTX™ 4070 with GDDR6 memory ensures smooth and immersive graphics for gaming and creative work.</li><li>Generous Storage - The 512GB PCIe NVMe SSD offers fast data access and ample space for your files, applications, and media.</li><li>Sleek and Lightweight Design - The slim and lightweight Graphite chassis combines elegance with portability, making it ideal for both work and travel.</li><li>Robust Battery Life - A 76 Wh battery supports up to 17 hours of use, providing reliable power for extended sessions.</li><li>Comprehensive Connectivity - Includes essential ports and connectivity options for versatile and easy integration with your devices.</li></ul>",
        "price": 282990.00,
        "discount_price": 277990.00,
        "sku": "NP960XFH-XA2IT",
        "brand": "SAMSUNG",
        "images":[
            "/media/Ultrabooks/SAMSUNG_GALAXY_BOOK3/59ff9d48-9d92-485a-a923-6aaa3f086f65.jpg",
            "/media/Ultrabooks/SAMSUNG_GALAXY_BOOK3/7443c2d3-17cb-4fd6-9c51-22f57155d2ab.jpg",
            "/media/Ultrabooks/SAMSUNG_GALAXY_BOOK3/6aeb6f52-f30b-4a21-960e-96513e8ebb59.jpg",
            "/media/Ultrabooks/SAMSUNG_GALAXY_BOOK3/73dfb00b-2c6b-4af6-b475-be8ad610ed85.jpg",
            "/media/Ultrabooks/SAMSUNG_GALAXY_BOOK3/30fe27d3-d49b-43b9-b713-5fda048ae948.jpg"
        ],
        "stock": 2,
        "is_available": "True",
        "rating": 3.8,
        "num_reviews": 4,
        "dimensions": "25.1 x 35.5 x 1.3 cm",
        "weight": 1.56,
        "warranty": "1 year",
        "color": "Graphite",
        "laptop_type": "Ultrabooks",
        "cpu": "13th Gen Intel Core i7-1360P",
        "ram": "32 GB DDR5",
        "storage": "1 TB SSD",
        "display": "16 inches WQXGA+ AMOLED",
        "graphics": "NVIDIA GeForce RTX 4070",
        "operating_system": "Windows 11 Home",
        "battery_life": "17 hours",
        "touchscreen": "True"
    }
]